{
    "id": "h_a612776564ca4b795dc938f3cf95d740",
    "url": "https://www.cnn.com/2021/01/23/us/explosion-los-angeles-church-vandalism/index.html",
    "firstPublishDate": "2021-01-23T19:15:55Z",
    "lastPublishDate": "2021-01-23T19:47:41Z",
    "contributors": [
        "Artemis Moshtaghian",
        "Alaa Elassar"
    ],
    "headline": "Police are investigating an overnight explosion at a suburban Los Angeles church",
    "section": "us",
    "thumbnail": "https://cdn.cnn.com/cnnnext/dam/assets/210123132517-map-explosion-los-angeles-church-vandalism-trnd-story-body.jpg",
    "body": "Police are investigating vandalism and an explosion at a church in the San Gabriel Valley of Los Angeles County on Saturday. Police were called to First Works Baptist Church in El Monte around 1 a.m. where they found the walls of the church vandalized and smoke coming out of the church's window, which appeared to be smashed in. \"We realized that the windows were not smashed, that they had actually blown out from some type of explosion,\" said El Monte Police Department Lt. Christopher Cano. The FBI's Los Angeles field office said agents responded along with El Monte police and the Los Angeles County Sheriff's Department to what it called an \"IED attack\" at the church. IED is an acronym for improvised explosive device. \"Bomb Technicians and an Evidence Response Team are processing the scene which sustained damage. No injuries are reported,\" the field office said in a statement. The field office said a joint investigation is underway and anyone with information on the incident should contact the Los Angeles field office. Police did not provide any further details and church representatives were not readily available for comment.  The church had been the center of some local protests due to its condemnation of same-sex relationships, according to CNN affiliate KCAL.  The church is described as an \"independent, fundamental\" Baptist church on its website, which includes a doctrinal statement listing the church's beliefs. One of the beliefs listed is: \"We believe that homosexuality is a sin and an abomination which God punishes with the death penalty.\" A protest scheduled for Sunday by a group called Keep El Monte Friendly has been canceled, according to the group's Facebook page. El Monte is located about 16 miles east of Los Angeles."
}